#+TITLE:    Rationalizability
#+AUTHOR:    Christoph
#+EMAIL:    
#+DATE:      2015-08-07 Fri
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t 
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc 
#+INFOJS_OPT: view:nil toc:nil ltoc:nil mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport

* Iterative elimination of strictly dominated strategies in Cournot

Here we want to repeat the iterative elimination of strictly dominated actions in the Cournot game. We will use a simple two firm Cournot game with inverse demand

$$p(q_1,q_2)=1-q_1-q_2$$

and marginal costs equal to zero. The action set of each player is $[0,1]$. This means that the best response functions are
$$br_1(q_2)=\frac{1-q_2}{2}$$
$$br_2(q_1)=\frac{1-q_1}{2}.$$

We will now eliminate in the first round all actions of player 1 that cannot be a best response for any belief P1 might have. If P1 believes that P2 uses the mixed strategy given by the probability distribution $F(q_2)$, his expected profits are
$$\pi(q_1)= \int_0^1q_1(1-q_1-q_2)\,dF(q_2).$$
From the first order condition, we get the generalized best response
$$q_1(F(q_2))=\frac{\int_0^11-q_2\;dF(q_2)}{2}.$$
If $F$ puts all probability mass on 1, this best response is 0. If $F$ puts all probability mass on 0, the best response is $1/2$. For all other distributions, the best response is between 0 and $1/2$. Hence, we can eliminate all quantities greater than $1/2$: There is no belief such that these quantities would be a best response. 

In the next iteration, we ask which actions can be best responses by P2 given that P1 uses only actions in $[0,1/2]$. Recall that $br_2(0)=1/2$ and $br_2(1/2)=1/4$. For any strategy $F(q_1)$ with support in $[0,1/2]$, P2's best response in somewhere between $1/4$ and $1/2$ (verify!).

Now we can go back to P1...

Computers are better at iterations than humans; so let's feed this problem into the machine.

#+BEGIN_SRC python :session Cournot :exports both :results output

  import numpy as np
  from matplotlib import pyplot as plt
  from matplotlib import animation
  from prettytable import PrettyTable

  #best response function
  def br(q):
      return (1-q)/2.

  br_vec = np.vectorize(br)

  #inverse of best response function
  def br_inv(q):
      return 1-2*q

  br_inv_vec = np.vectorize(br_inv)

  #calculate the range of best response if the other plays qj Qj
  #starting from Qj=[0,1], iterate this i times
  def iterative_br(i):
      lower,upper = 0.,1.
      for i in xrange(i):
          lower,upper = br(upper),br(lower)
      return lower, upper

  t = PrettyTable(['iteration','lower bound','upper bound'])

  for i in range(0,11,1):
      dummy = iterative_br(i)
      t.add_row([i,round(dummy[0],3),round(dummy[1],3)])

  print t
#+END_SRC

#+RESULTS:
#+begin_example

>>> >>> >>> >>> >>> ... ... ... >>> >>> >>> ... ... ... >>> >>> >>> ... ... ... ... ... ... ... >>> >>> >>> ... ... ... >>> +-----------+-------------+-------------+
| iteration | lower bound | upper bound |
+-----------+-------------+-------------+
|     0     |     0.0     |     1.0     |
|     1     |     0.0     |     0.5     |
|     2     |     0.25    |     0.5     |
|     3     |     0.25    |    0.375    |
|     4     |    0.313    |    0.375    |
|     5     |    0.313    |    0.344    |
|     6     |    0.328    |    0.344    |
|     7     |    0.328    |    0.336    |
|     8     |    0.332    |    0.336    |
|     9     |    0.332    |    0.334    |
|     10    |    0.333    |    0.334    |
+-----------+-------------+-------------+
#+end_example

As you see, we get pretty quickly pretty close to the Nash equilibrium and indeed in the limit only the Nash equilibrium $(1/3,1/3)$ remains. That is, the Nash equilibrium action is the only rationalizable action of the simple Cournot game! The following visualizes this.

#+BEGIN_SRC python :session Cournot :exports both :results file
  fig = plt.figure()
  ax = plt.axes(xlim=(0,1), ylim=(0,1))
  plt.ylabel('$q_1$')
  plt.xlabel('$q_2$')
  line1, = ax.plot([],[],'b',linewidth=1.5)#not yet eliminated q1 on best response function
  line2, = ax.plot([],[],'r',linewidth=1.5)
  ratio1, = ax.plot([],[],'b',linewidth=3)#marks not yet eliminated q1 on axis
  ratio2, = ax.plot([],[],'r',linewidth=3)
  br1,   = ax.plot([],[],'b:',linewidth=1.5)#best response function of P1
  br2,   = ax.plot([],[],'r:',linewidth=1.5)
  plt.legend([br1,br2,ratio1,ratio2],['$br_1(q_2)$','$br_2(q_1)$','not yet eliminated $q_1$','not yet eliminated $q_1$'])

  #basic plot that is held fixed through out all iterations
  def init():
      line1.set_data([],[])
      line2.set_data([],[])
      ratio1.set_data([],[])
      ratio2.set_data([],[])
      x = np.linspace(0,1,50)
      br_curve = br_vec(x)#np.ndarray(br_vec(x))
      br1.set_data(x,br_curve)
      br2.set_data(br_curve,x)
      return line1,line2,br1,br2,ratio1,ratio2

  def animate(i):
      if i % 2 != 0:#true if i is odd
          temp = iterative_br(i)
          y1 = np.linspace(temp[0],temp[1],50)
          x1 = br_inv_vec(y1)
          temp = iterative_br(i-1)
          x2 = np.linspace(temp[0],temp[1],50)
          y2 = br_inv_vec(x2)
      else:#if i is even
          temp = iterative_br(i)
          x2 = np.linspace(temp[0],temp[1],50)
          y2 = br_inv_vec(x2)
          temp = iterative_br(i-1)
          y1 = np.linspace(temp[0],temp[1],50)
          x1 = br_inv_vec(y1)
      helpratio = np.zeros(50)+0.002
      line1.set_data(x1,y1)
      ratio1.set_data(helpratio,y1)
      line2.set_data(x2,y2)
      ratio2.set_data(x2,helpratio)
      return line1,line2,ratio1,ratio2
      
  anim = animation.FuncAnimation(fig,animate,init_func=init,frames=10,repeat=False,interval = 1000,blit=True)

  anim.save('Cournot_iterative.mp4',fps=1,extra_args=['-vcodec','libx264'])

  #plt.show()
  'Cournot_iterative.mp4'
#+END_SRC


